package homework;

public class Turnip {
    public static void main(String[] args) {
        turnip();
    }
    public static void turnip() {
        System.out.println("Посадил дед репку.Выросла репка большая прибольшая,а вытянуть не может." +
                "Позвал дед бабку");
        System.out.println("Пришла бабка, тянут, потянут. вытащить не могут. " +
                "Позвала бабка внучку. Стали тянуть вместе" +
                "Позвала внучка Жучку,тянут потянут не могут вытащить. " +
                "Позвала внучка Жучку.Жучка позвала Мурку,Мурка позвала мышку" +
                "Тянут, потянут и вытащили репку");

    }
    }

